In [46]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [47]:
raw_data = {'first_name':['석','양','김','최','감'],
            'last_name':['찬휘','영진','진환','호정','명준'],
            'age':[29,26,27,26,26],
            'city':['cheong-ju','guang-ju','deajeon','guang-ju','guang-ju']}
df = pd.DataFrame(raw_data, columns = ['first_name','last_name','age','city'])
df

  first_name last_name  age       city
0          석        찬휘   29  cheong-ju
1          양        영진   26   guang-ju
2          김        진환   27    deajeon
3          최        호정   26   guang-ju
4          감        명준   26   guang-ju

In [48]:
DataFrame(raw_data, columns=['age','city','debt']) #없는 column은 자동으로 추가

   age       city debt
0   29  cheong-ju  NaN
1   26   guang-ju  NaN
2   27    deajeon  NaN
3   26   guang-ju  NaN
4   26   guang-ju  NaN

In [49]:
#series 추출1
df=DataFrame(raw_data,columns=["first_name","last_name","age","debt"])
df.first_name

0    석
1    양
2    김
3    최
4    감
Name: first_name, dtype: object

In [50]:
#series 추출2
df["last_name"]

0    찬휘
1    영진
2    진환
3    호정
4    명준
Name: last_name, dtype: object

loc : index location - 인덱스의 이름을 통해 가져오는것..(이름기준)


iloc : index position - 인덱스 숫자 기준

In [51]:
df.loc[1]   #series 데이터

first_name      양
last_name      영진
age            26
debt          NaN
Name: 1, dtype: object

In [52]:
df["age"].iloc[1:] #series 데이터

1    26
2    27
3    26
4    26
Name: age, dtype: int64

Column에 새로운 데이터 할당하기

In [53]:
df.debt =df.age >26
df

  first_name last_name  age   debt
0          석        찬휘   29   True
1          양        영진   26  False
2          김        진환   27   True
3          최        호정   26  False
4          감        명준   26  False

그외 다양한 기능들

In [54]:
df.values #값 출력

array([['석', '찬휘', 29, True],
       ['양', '영진', 26, False],
       ['김', '진환', 27, True],
       ['최', '호정', 26, False],
       ['감', '명준', 26, False]], dtype=object)

In [55]:
df.T   #transpose

               0      1     2      3      4
first_name     석      양     김      최      감
last_name     찬휘     영진    진환     호정     명준
age           29     26    27     26     26
debt        True  False  True  False  False

In [56]:
df.to_csv()  #csv로 변환

',first_name,last_name,age,debt\r\n0,석,찬휘,29,True\r\n1,양,영진,26,False\r\n2,김,진환,27,True\r\n3,최,호정,26,False\r\n4,감,명준,26,False\r\n'

In [57]:
del df["debt"]      #column 삭제함
df

  first_name last_name  age
0          석        찬휘   29
1          양        영진   26
2          김        진환   27
3          최        호정   26
4          감        명준   26